/// Карта докэлементов и токенов Динрус для форматирования текстов.
ткст[ткст] карта = [
  "ЗаголовокДок" : `<?xml version="1.0"?>`\n
              `<?xml-stylesheet href="xml.css" type="text/css"?>`\n
              "<root>\n",
  "КонецДок"  : "\n</root>",
  "НачалоИсходника" : "<sourcecode>",
  "КонецИсходника"   : "\n</sourcecode>",
  "НачалоКомп"   : "<compiler>\n",
  "КонецКомп"     : "</compiler>\n",
  "ОшибкаЛексера"  : `<error t="L">{0}({1},{2})L: {3}</error>`\n,
  "ОшибкаПарсера" : `<error t="P">{0}({1},{2})P: {3}</error>`\n,
  "НачалоНомераСтроки" : `<linescolumn>`,
  "КонецНомераСтроки"   : `</linescolumn>`,
  "НомерСтроки"      : `<a xml:id="L{0}">{0}</a>`,

  // Node categories:
  "Декларация" : "d",
  "Инструкция"   : "s",
  "Выражение"  : "в",
  "Тип"        : "t",
  "Иное"       : "o",

  // {0} = категория узла.
  // {1} = название класса узла: "Call", "Если", "Class" и проч.
  // Напр.: <d t="Struct">...</d>
  "НачалоУзла" : `<{0} t="{1}">`,
  "КонецУзла"   : `</{0}>`,

  "Идентификатор" : "<i>{0}</i>",
  "Ткст"     : "<sl>{0}</sl>",
  "Сим"       : "<cl>{0}</cl>",
  "Число"     : "<n>{0}</n>",
  "КСлово"    : "<k>{0}</k>",

  "LineC"   : "<lc>{0}</lc>",
  "BlockC"  : "<bc>{0}</bc>",
  "NestedC" : "<nc>{0}</nc>",

  "Шебанг"  : "<shebang>{0}</shebang>",
  "HLine"    : "<hl>{0}</hl>", // #line
  "Filespec" : "<fs>{0}</fs>", // #line N "filespec"
  "НовСтр"  : "{0}", // \n | \r | \r\n | РС | РА
  "Нелегал"  : "<ill>{0}</ill>", // A character not recognized by the лексер.

  "ОсобаяСема" : "<st>{0}</st>", // __FILE__, __LINE__ etc.

  "("    : "<br>(</br>",
  ")"    : "<br>)</br>",
  "["    : "<br>[</br>",
  "]"    : "<br>]</br>",
  "{"    : "<br>{</br>",
  "}"    : "<br>}</br>",
  "."    : ".",
  ".."   : "..",
  "..."  : "...",
  "!<>=" : "!&lt;&gt;=", // Unordered
  "!<>"  : "!&lt;&gt;",  // UorE
  "!<="  : "!&lt;=",     // UorG
  "!<"   : "!&lt;",      // UorGorE
  "!>="  : "!&gt;=",     // UorL
  "!>"   : "!&gt;",      // UorLorE
  "<>="  : "&lt;&gt;=",  // LorEorG
  "<>"   : "&lt;&gt;",   // LorG
  "="    : "=",
  "=="   : "==",
  "!"    : "!",
  "!="   : "!=",
  "<="   : "&lt;=",
  "<"    : "&lt;",
  ">="   : "&gt;=",
  ">"    : "&gt;",
  "<<="  : "&lt;&lt;=",
  "<<"   : "&lt;&lt;",
  ">>="  : "&gt;&gt;=",
  ">>"   : "&gt;&gt;",
  ">>>=" : "&gt;&gt;&gt;=",
  ">>>"  : "&gt;&gt;&gt;",
  "|"    : "|",
  "||"   : "||",
  "|="   : "|=",
  "&"    : "&amp;",
  "&&"   : "&amp;&amp;",
  "&="   : "&amp;=",
  "+"    : "+",
  "++"   : "++",
  "+="   : "+=",
  "-"    : "-",
  "--"   : "--",
  "-="   : "-=",
  "/"    : "/",
  "/="   : "/=",
  "*"    : "*",
  "*="   : "*=",
  "%"    : "%",
  "%="   : "%=",
  "^"    : "^",
  "^="   : "^=",
  "~"    : "~",
  "~="   : "~=",
  ":"    : ":",
  ";"    : ";",
  "?"    : "?",
  ","    : ",",
  "$"    : "$",
  "КФ"  : ""
];
