/* Converted to D from coff.h by htod */
module coff;
//C     ﻿
/****************************   coff.h   *************************************
* Author:        Agner Fog
* Date created:  2006-07-15
* Last modified: 2008-06-04
* Project:       objconv
* Module:        coff.h
* Description:
* Файл-заголовок для определения структур в файловом формате объектов MS Windows COFF Intel x86 (PE).
*
* Copyright 2006-2008 GNU General Public License http://www.gnu.org/licenses
* Parts (c) 1995 DJ Delorie GNU General Public License
*****************************************************************************/

/*****************************************************************************
* Note: Структуры данных COFF не совпадают с дефолтной расстановкой современных
* компиляторов. Все структуры следует компилировать без каких-либо alignment padding.
* Спецификация упаковки структур для компиляторов не стандартизирована.
* Можно удалить или заменить директиву #pragma pack, если никогда не будет использоваться
* оператор sizeof() или арифметика указателей на какие-либо структуры, нуждающиеся в 
* упаковке. Пример смотрите в coff.cpp.
*****************************************************************************/

//C     #ifndef PECOFF_H
//C     #define PECOFF_H

/********************** ЗАГОЛОВОК ФАЙЛА **********************/

//C     struct SCOFF_FileHeader {
//C      uint16 Machine;              // ИД машины (магическое число)
//C      uint16 NumberOfSections;     // число секций
//C      uint32 TimeDateStamp;        // штамп времени и даты 
//C      uint32 PSymbolTable;         // файловый указатель на таблицу символов
